# BorderRightLineStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableCellStyleOverrideOptions..::..BorderRightLineStyle Property
TableCellStyleOverrideOptions Class See Also
---
Indicates if the border right line style characteristic is overridden.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool BorderRightLineStyle { get; set; }
```

Visual Basic
---
```text
Public Property BorderRightLineStyle As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool BorderRightLineStyle {
	bool get ();
	void set (bool value);
}
```

# See Also
TableCellStyleOverrideOptions Class
Autodesk.Revit.DB Namespace